src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУсловийДоговора</name>
    <comment>(Упр) </comment>
    <type>
      <types>EnumRef.ВидыУсловийДоговоровВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДержатьРезервБезОплатыОграниченноеВремя</name>
    <comment>(Упр) Держать резерв без оплаты ограниченное/неограниченное время</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеЧислоДнейЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСуммуЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЧислоДнейЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленныйУчетТоваровПоЗаказамПокупателей</name>
    <comment>(Общ) Обособленный партионный учет Товаров по заказам покупателей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПредоплаты</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>EnumRef.СпособыРасчетаКомиссионногоВознаграждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ) Тип цен по умолчанию для оформления покупок по данному договору</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатурыКонтрагентов</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейРезерваБезОплаты</name>
    <comment>(Упр) Если 0, то неограничено</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаНалоговогоУчета</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.СхемыНалоговогоУчетаПоДоговорамКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаНалоговогоУчетаПоТаре</name>
    <comment>(Регл) Схема налогового учета для операций взаиморасчетов по таре</comment>
    <type>
      <types>CatalogRef.СхемыНалоговогоУчетаПоДоговорамКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиДляДДС</name>
    <comment>(Регл)</comment>
    <type>
      <types>EnumRef.ВидыДеятельностиДляДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИнформациюОСделкеПриПечатиДокументов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПоДокументамРасчетовСКонтрагентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьВЛБпоВД</name>
    <comment>(только для ВЭД-договоров)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьВРпоВЛБ</name>
    <comment>(только для ВЭД-договоров)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяВРКорректировок</name>
    <comment>для переоценки вал. задолженности по ВЛБ для сложного налогового учета</comment>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалоговойДеятельностиКорректировкиПриобретений</name>
    <comment>для переоценки вал. задолженности по ВЛБ </comment>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетовРегл</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтноситьНаЗатратыПоНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтрагентаДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Бартерный</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ВедениеВзаиморасчетовПоДоговорам/ВедениеВзаиморасчетовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВедениеВзаиморасчетовПоДоговорам</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДоговоруВЦелом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЗаказам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСчетам</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СхемыНалоговогоУчетаПоДоговорамКонтрагентов/СхемыНалоговогоУчетаПоДоговорамКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыНалоговогоУчетаПоДоговорамКонтрагентов</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>СКомиссионером</name>
      <description>(не используется) С комиссионером (до 20</description>
    </items>
    <items>
      <name>СКомитентом</name>
      <description>(не используется) С комитентом (до 2011)</description>
    </items>
    <items>
      <name>Бартер</name>
      <description>Бартер</description>
    </items>
    <items>
      <name>ВЭД</name>
      <description>ВЭД (импорт/экспорт)</description>
    </items>
    <items>
      <name>ПоПервомуСобытию</name>
      <description>По первому событию</description>
    </items>
    <items>
      <name>СКомиссионером_НК</name>
      <description>С комиссионером (с 2011)</description>
    </items>
    <items>
      <name>СКомитентом_НК</name>
      <description>С комитентом (с 2011)</description>
    </items>
  </predefined>
  <attributes>
    <name>МоментОпределенияБазыНДСПоПокупкам</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>МоментОпределенияБазыНДСПоПродажам</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬМоментОпределенияБазыННППоПокупкам</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬМоментОпределенияБазыННППоПродажам</name>
    <type>
      <types>EnumRef.МоментыОпределенияНалоговойБазы</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заполнение переменных формы
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	СписокВыбораВидаДоговора = ПолучитьСписокВыбораВидаДоговора(Объект.Владелец);
		
	ВидДоговораПрочее 			= Перечисления.ВидыДоговоровКонтрагентов.Прочее;
	ВидДоговораСКомиссионером 	= Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;
	ВидДоговораСКомитентом 		= Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
	ВидДоговораСПокупателем 	= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ВидДоговораСПоставщиком 	= Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	
	ВедениеВзаиморасчетовПоДоговоруВЦелом = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()

	Элементы.ВедениеВзаиморасчетов.Доступность = (Объект.ВидДоговора <> ВидДоговораПрочее
														И ЗначениеЗаполнено(Объект.ВидДоговора));
	Элементы.ВедениеВзаиморасчетовРегл.Доступность = (Объект.ВидДоговора <> ВидДоговораПрочее
														И ЗначениеЗаполнено(Объект.ВидДоговора));

	// Установка видимости реквизита реализации на экспорт
	Если Объект.ВидДоговора <> ВидДоговораСПокупателем Тогда
		Элементы.РеализацияНаЭкспорт.Доступность = Ложь;
	Иначе
		Элементы.РеализацияНаЭкспорт.Доступность = Истина;
	КонецЕсли;

	Элементы.ВестиПоДокументамРасчетовСКонтрагентом.Доступность = Объект.ВидДоговора <> ВидДоговораПрочее;
КонецПроцедуры // УстановитьВидимость()

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораВидаДоговора(Контрагент)
	СписокВыбораВидаДоговора = Новый СписокЗначений;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		СписокВыбораВидаДоговора = УправлениеВзаиморасчетами.ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее();
	Иначе
		Если Контрагент.Покупатель И Контрагент.Поставщик Тогда
			СписокВыбораВидаДоговора = ОбщегоНазначения.ПолучитьСписокЭлементовПеречисления("ВидыДоговоровКонтрагентов");
		ИначеЕсли Контрагент.Покупатель Тогда
			СписокВыбораВидаДоговора = УправлениеВзаиморасчетами.ПолучитьСписокВидовДоговоровВзаиморасчетовДляПокупателя();
		ИначеЕсли Контрагент.Поставщик Тогда
			СписокВыбораВидаДоговора = УправлениеВзаиморасчетами.ПолучитьСписокВидовДоговоровВзаиморасчетовДляПоставщика();
		Иначе
			СписокВыбораВидаДоговора = УправлениеВзаиморасчетами.ПолучитьСписокВидовДоговоровВзаиморасчетовПрочее();
		КонецЕсли; 
	КонецЕсли;
	Возврат СписокВыбораВидаДоговора;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокВыбораВидаДоговора()
	Элементы.ВидДоговора.СписокВыбора.Очистить();
	Для Каждого ЭлементСписка ИЗ СписокВыбораВидаДоговора Цикл
		НовыйЭлементСписка = Элементы.ВидДоговора.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	СписокВыбораВидаДоговора = ПолучитьСписокВыбораВидаДоговора(Объект.Владелец);
	ЗаполнитьСписокВыбораВидаДоговора();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипЦенДоговора()
	Если Объект.ВидДоговора = ВидДоговораСПокупателем ИЛИ 
		Объект.ВидДоговора = ВидДоговораСКомиссионером Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатуры");
	ИначеЕсли Объект.ВидДоговора = ВидДоговораСПоставщиком ИЛИ 
		Объект.ВидДоговора = ВидДоговораСКомитентом Тогда
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов");
	Иначе
		Возврат;
	КонецЕсли; 
	Объект.ТипЦен = ОписаниеТипов.ПривестиЗначение(Объект.ТипЦен);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьТипЦенДоговора();
		ЗаполнитьВедениеВзаиморасчетов();
		УстановитьСхемуНалогообложения();
	КонецЕсли;
	ЗаполнитьСписокВыбораВидаДоговора();
	ЗаполнитьСписокВыбораВедениеВзаиморасчетовРегл();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ВидДоговора) ИЛИ Объект.ВидДоговора = ВидДоговораПрочее Тогда
		Объект.ВедениеВзаиморасчетов                    = ВедениеВзаиморасчетовПоДоговоруВЦелом;
		Объект.ТипЦен                                   = Неопределено;
		Объект.ВестиПоДокументамРасчетовСКонтрагентом   = Ложь;
	КонецЕсли;

	//Зачистка флага "Реализация на экспорт" для всех видов договоров кроме договора с покупателем
	Если Объект.ВидДоговора <> ВидДоговораСПокупателем Тогда
		Объект.РеализацияНаЭкспорт = Ложь;
	КонецЕсли;
	
	УстановитьТипЦенДоговора();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенОчистка(Элемент, СтандартнаяОбработка)
	УстановитьТипЦенДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВедениеВзаиморасчетовПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораВедениеВзаиморасчетовРегл();
	
	Объект.ВедениеВзаиморасчетовРегл = Объект.ВедениеВзаиморасчетов;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораВедениеВзаиморасчетовРегл(ВедениеВзаиморасчетов)
	СписокВыбораВедениеВзаиморасчетов = Новый СписокЗначений;
	Если ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
		СписокВыбораВедениеВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		СписокВыбораВедениеВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам);
	ИначеЕсли ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		СписокВыбораВедениеВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
		СписокВыбораВедениеВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам);
	Иначе
		СписокВыбораВедениеВзаиморасчетов.Добавить(Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
	КонецЕсли;
	
	Возврат СписокВыбораВедениеВзаиморасчетов;
КонецФункции

&НаСервере
Функция ЗаполнитьСписокВыбораВедениеВзаиморасчетовРегл()
	
	СписокВыбораВедениеВзаиморасчетов = ПолучитьСписокВыбораВедениеВзаиморасчетовРегл(Объект.ВедениеВзаиморасчетов);
    Элементы.ВедениеВзаиморасчетовРегл.СписокВыбора.Очистить();
	Для Каждого ЭлементСписка ИЗ СписокВыбораВедениеВзаиморасчетов Цикл
		НовыйЭлементСписка = Элементы.ВедениеВзаиморасчетовРегл.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
  	
КонецФункции

&НаСервере
Процедура ЗаполнитьВедениеВзаиморасчетов()
	 Если   Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный
		Тогда
			Объект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		Иначе
		Если НЕ ЗначениеЗаполнено(Объект.ВедениеВзаиморасчетов) Тогда
			Объект.ВедениеВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
			Если НЕ ЗначениеЗаполнено(Объект.ВедениеВзаиморасчетов) Тогда
				Объект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    Объект.ВедениеВзаиморасчетовРегл = Объект.ВедениеВзаиморасчетов;
КонецПроцедуры

&НаСервере
Процедура УстановитьСхемуНалогообложения()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		Объект.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомиссионером;
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
		Объект.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.СКомитентом;
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		Объект.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.Бартер;
	Иначе
		Если НЕ Объект.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда
			Объект.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ВЭД;		
		Иначе	
			Объект.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
		КонецЕсли;
	КонецЕсли;

	Объект.СхемаНалоговогоУчетаПоТаре = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;
	
КонецПроцедуры
